# Задача 2
# Найдите сумму цифр трехзначного числа.
# Пример:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

print("----------Задание 2----------")
print("Введите трёхзначное число: ")
number = int(input())
a = number // 100
b = number // 10 % 10
c = number % 10
s = a+b+c
print(s)







